{
  "transformation_time": "2026-01-19T23:10:05.656238",
  "source_file": "data\\processed\\extracted.json",
  "records": [
    {
      "website": "https://www.apache.org",
      "section": "navbar",
      "content": "Community Contributor Getting Started Becoming a Committer Code of Conduct Community Resources Community Over Code Events Projects Projects Incubator Projects Projects Directory Mailing Lists Report a Vulnerability The Apache Attic Downloads Distributions Releases Infrastructure Status Infrastructure Statistics Learn Blog How the ASF Works The Apache Way Legal & Trademark Licenses Glossary FAQ Resources & Tools Developer Information Wiki Issues Slack Self Serve Portal Infrastructure Whimsy Brand Guidelines Project Logos About About Our Sponsors Corporate Sponsorship Individual Supporters Leadership Members Diversity & Inclusion Newsroom Contact Sponsor Search",
      "crawl_timestamp": "2026-01-19T22:17:21.914227",
      "isActive": true
    },
    {
      "website": "https://www.apache.org",
      "section": "homepage",
      "content": "Software For The Public Good¶ The Apache® Software Foundation (ASF) provides software for the public good, guided by community over code. Like the enduring oak tree, our projects thrive through the contributions of thousands worldwide. See Projects Our Impact¶ 290+ Open Source Projects 1300+ Software Releases 9800+ Committers 1140+ Members Our Open Source Projects¶ The ASF is the home of the world’s most trusted open source projects in data, cloud, search, libraries, geospatial, IoT, and beyond. See All Projects Our Incubating Projects¶ See All Incubating Projects Incubate a Project¶ Give your project a neutral, trusted home where communities flourish — with the ASF’s expertise, tools, and support to help you succeed. Incubate Project Everyone is Welcome¶ At The ASF, contribution is for everyone. Whether code, docs, or ideas — your +1 makes a difference. Come contribute and grow with us. New to The ASF? Start here Upcoming Events¶ Flink Forward 2026¶ Shenzen, China¶ July 11-12, 2026 Flink Forward is the streaming data event for the future, bringing communities together to learn, network, and share experiences and best practices in stream processing, real time analytics, event-driven applications, AI and real-time intelligence, and the management of mission-critical Flink deployments in production. See Event â® â¯ Thank You, Sponsors¶ The ASF is a 501(c)(3) nonprofit, supported by individual and corporate donors who believe in secure software for the public good and the power of community over code. See All Sponsors ASF Plus One¶ Explore what’s new at The ASF — from project news to community voices, all in one place. Most Recent Blog Posts¶ Community Over Code Europe 2026 announced for Glasgow, Scotland¶ Read Post The Apache Software Foundation Announces Apache Geode® 2.0¶ Read Post The Apache Software Foundation Announces New Top-Level Projects¶ Read Post Plus One Newsletter¶ ASF Plus One Newsletter: December 2025¶ Read Post ASF Plus One Newsletter: November 2025¶ Read Post ASF Plus One Newsletter: October 2025¶ Read Post Plus One Podcast¶ Apache Grails: James Fredley and James Daugherty¶ Listen Now Airflow 3.x and beyond¶ Listen Now Dave Fisher, VP Tooling¶ Listen Now Growing Together¶ From first contributions to global impact, these stories show the strength of our community.",
      "crawl_timestamp": "2026-01-19T22:17:21.914227",
      "isActive": true
    },
    {
      "website": "https://www.apache.org",
      "section": "footer",
      "content": "Apache and the Apache logo are trademarks of The Apache Software Foundation. The ApacheÂ® Software Foundation is a 501(c)(3) nonprofit organization. Tax ID # 47-0825376 Donate Community Contributor Getting Started Becoming a Committer Code of Conduct Community Resources Community Over Code Events Learn Blog How the ASF Works The Apache Way Legal & Trademark Licenses Glossary FAQ Projects Projects Incubator Projects Projects Directory Mailing Lists Report a Vulnerability Resources & Tools Developer Information Wiki Issues Slack Self Serve Portal Infrastructure Whimsy Brand Guidelines Project Logos Downloads Distributions Releases Infrastructure Status Infrastructure Statistics About About Our Sponsors Corporate Sponsorship Individual Supporters Leadership Members Diversity & Inclusion Newsroom Contact Privacy Policy Copyright © 2026 The Apache Software Foundation, Licensed under the Apache License, Version 2.0.",
      "crawl_timestamp": "2026-01-19T22:17:21.914227",
      "isActive": true
    },
    {
      "website": "https://www.apache.org",
      "section": "case_study",
      "content": "",
      "crawl_timestamp": "2026-01-19T22:17:21.914227",
      "isActive": true
    },
    {
      "website": "https://www.docker.com",
      "section": "navbar",
      "content": "AI AI Docker for AI Simplifying Agent Development Docker Offload Break free of local constraints Docker MCP Catalog and Toolkit Connect and manage MCP tools Docker Model Runner Local-first LLM inference made easy More resources for developers Docker Brings Compose to the Agent Era: Building AI Agents is Now Easy Docker Accelerates Agent Development Read more Products Products Docker Hardened Images Ship with secure, enterprise-ready images Docker Desktop Containerize your applications Docker Hub Discover and share container images Docker Scout Simplify the software supply chain Docker Build Cloud Speed up your image builds Testcontainers Desktop Local testing with real dependencies Testcontainers Cloud Test without limits in the cloud Docker MCP Catalog and Toolkit Connect and manage MCP tools Docker Desktop v4.50 Find out what’s new to Docker Desktop in the latest release Read more Developers Developers Documentation Find guides for Docker products Getting Started Learn the Docker basics Resources Search a library of helpful materials Training Skill up your Docker knowledge Extensions SDK Create and share your own extensions Community Connect with other Docker developers Open Source Explore open source projects Preview Program Help shape the future of Docker Customer Stories Get inspired with customer stories More resources for developers Introducing Docker Model Runner A faster, simpler way to run and test AI models locally Read more Deliver Quickly. Build Securely. Stay Competitive. Meet growing demands for speed and security with integrated, efficient solutions Read more Get the latest Docker news PricingSupportBlog Company Company About Us Let us introduce ourselves What is a Container? Learn about containerization Why Docker Discover what makes us different Trust Find our customer trust resources Partners Become a Docker partner Customer Success Learn how you can succeed with Docker Events Attend live and virtual meet ups Docker Store Gear up with exclusive SWAG Careers Apply to join our team Contact Us We’d love to hear from you Docker Announces SOC 2 Type 2 Attestation & ISO 27001 Certification Learn what this means for Docker security and compliance Read more",
      "crawl_timestamp": "2026-01-19T22:18:00.424697",
      "isActive": true
    },
    {
      "website": "https://www.docker.com",
      "section": "homepage",
      "content": "A safer container ecosystem, for everyone Free hardened images give every developer a trusted starting point, with enterprise options for SLAs, compliance, and extended lifecycle security. Start building with DHI Download Docker Desktop Download for Mac – Apple Silicon Download for Mac – Intel Chip Download for Windows – AMD64 Download for Windows – ARM64 Download for Linux Security MCP Agents Containers Near-zero CVE images, now accessible to everyone Open-source, Apache 2.0–licensed images built for trust while delivering near-zero CVEs, complete SBOMs, and SLSA Level 3 provenance. Upgrade to DHI Enterprise for SLAs, customization, and compliance, with extended lifecycle support for EOL images available as an add-on. Learn more about Docker Hardened Images Apache 2.0 freedom Docker Hardened Images are fully open source and free to use, share, and build on, with no licensing surprises and complete transparency. Minimal and distroless images Ultra-minimal distroless Debian and Alpine images that remove everything you don’t need, shrinking footprint and attack surface by up to 97%. Up to 95% CVE reduction Eliminate vulnerabilities before they reach production with continuously rebuilt images from Docker’s hardened pipeline and verified SBOMs. Extended Lifecycle Support for long-term protection Add-on protection after upstream support ends, with multi-year CVE patches, updated SBOMs, and verifiable provenance that eliminate long windows of unpatched risk. Start secure, customize easily Add your own tools, packages, certificates, or settings while inheriting Docker’s hardened pipeline, signed builds, and secure defaults. 1000+ images and applications Continuously growing catalog of FIPS and STIG ready languages, frameworks, databases, application images and Helm charts, all signed and verified with SLA-backed security. The easiest, most secure way to run MCP for your LLMs Docker MCP makes it easy for AI agents to securely call MCP servers. Run verified MCP servers as containers and leverage Docker’s built-in security, isolation, and reliability. Explore 250+ MCP servers All your MCP tools in one place Search, deploy, and safely connect to hundreds of tools, in seconds. Docker handles setup, authentication, and security so you can focus on building agents, not managing them. Launch-ready MCP servers + clients Access 200+ verified MCP servers for tools like Stripe, Notion, GitHub, and more. Connect instantly to clients such as Claude and Cursor with one-click setup and no dependency conflicts. Security you don’t have to think about Automatically stop emerging threats like Rug Pulls and Tool Poisoning. Every MCP server is signed and verified by Docker, with runtime isolation and access controls protecting your agents and data by default. Your full agentic stack. Just one command away. Define and run agents, models, and tools with Docker Compose. Orchestrate your entire agentic stack in a single file, then launch with one command. Create Your First Agent Compose for agents Run agents like you run apps. Spin up your full agentic stack with `docker compose up`. Deploy anywhere: locally, across clouds, or on Docker Cloud. Deploy anywhere Build and refine custom models locally. Orchestrate multi-agent systems. Then deploy anywhere: on your machine, across clouds, or on Docker Cloud. Security out of the box Every model, gateway, and tool runs in a trusted, signed container, isolating each component for built-in security and provenance. In the ever-evolving realm of AI, consistency is key. With Docker, we’ve achieved a level of reproducibility that ensures our AI models perform optimally, irrespective of where they are deployed. Dr. Sebastian Rhode Software Architect – AI Solutions, Staff Expert at Zeiss Microscopy The simplest way to build and run software. Anywhere. Everything you need to build, test, and ship applications, fast, repeatably, and securely. Turn “it works on my machine” into “it works everywhere.” Containerize Your Applications Download for Mac – Apple Silicon Download for Mac – Intel Chip Download for Windows – AMD64 Download for Windows – ARM64 Download for Linux Everything you need to build locally Spin up containers, define multi-service apps, and test end-to-end on your machine. Power your workflow with the platform trusted by millions. Security built in, confidence by default Hardened Docker Desktop enforces organizational policies and stops malicious payloads and runtime exploits, without slowing developers down. Start from trusted content Access the world’s largest library of verified, signed container images on Docker Hub. Ship faster with a secure, reliable starting point. Docker gave us more than containers. It gave us control. Now, every developer has a consistent, secure environment, and we ship confidently every day. Dheeraj Arani Head of DevOps at InCred Frictionless for devs, secure for teams, a joy for everyone “You’re not having to pay a security team to do all the things required for securing a container image because it’s already being done for you. The images are trusted, the software verified for minimal CVEs.” Cameron Griffin Sr. Cloud Security Engineer at GuidePoint Security Watch video Security and speed are not a paradox anymore Now free for all developers. Docker delivers enterprise security without slowing developers. Hardened images, automated scans, and verified provenance turn open source into your advantage. Five pillars of supply chain security Docker’s approach rests on five pillars: minimal images, signed provenance, complete SBOMs, VEX insights, and transparent verification. Discover Docker’s approach Run Helm charts, hardened by Docker Use Helm charts powered by Docker Hardened Images to deploy secure, compliant Kubernetes apps with confidence. Explore Helm Charts in Docker Hub Join the move to a safer container ecosystem DHI is now free for everyone. Start building with hardened, distroless, provenance-verified images trusted by teams across the world. Learn core concepts of Docker security Get access to industry-leading CVE remediation SLA 30-day free trial Sign in to try DHI Enterprise “We evaluated multiple options for hardened base images and chose Docker Hardened Images (DHI) for its alignment with our supply chain security posture, developer tooling compatibility, Docker’s maturity in this space, and integration with our existing infrastructure. Our focus was on balancing trust, maintainability, and ecosystem compatibility.” Vikram Sethi Principal Scientist at Adobe Accelerate every workflow. From apps to agents. The fastest path from idea to running software. Whether you’re building agents or containers. Start building with Docker Desktop Build once, run anywhere From your first line of code to production, containers make every environment consistent so you can move faster, debug less, and ship more confidently. Containers + MCP: better together Spin up and connect to containerized MCP servers like GitHub or Browserbase in seconds, right from Docker Desktop. Build smarter agents faster with no setup. From client to server: the new kinds Build smarter agents faster by spinning up and connecting to MCP servers. Interface with them with your favorite clients like Cursor or Claude directly from Docker Desktop. “Docker enables us to do so much, and it’s constantly improving. And every time I look at the docs, I’m like, this is new. I didn’t know about this.” Sanchita Agarwal Senior Software Engineer at Cloudflare Share AI agents just like you share containers. Docker Hub now hosts MCP servers, AI models, and agent blueprints, alongside 20 million containers. Find what you need. Publish what you’ve built. Go to Docker Hub Where developers build, share, and run secure software 14M+ images 11B+ monthly downloads 24M+ users Build better, together Download Docker Desktop now to get started, or choose a plan that’s right for you. Choose plan Download Docker Desktop Download for Mac – Apple Silicon Download for Mac – Intel Chip Download for Windows – AMD64 Download for Windows – ARM64 Download for Linux",
      "crawl_timestamp": "2026-01-19T22:18:00.424697",
      "isActive": true
    },
    {
      "website": "https://www.docker.com",
      "section": "footer",
      "content": "Products Products Overview Docker Desktop Docker Hub Docker Scout Docker Build Cloud Testcontainers Desktop Testcontainers Cloud Docker MCP Catalog and Toolkit Docker Hardened Images Features Command Line Interface IDE Extensions Container Runtime Docker Extensions Trusted Open Source Content Secure Software Supply Chain Developers Documentation Getting Started Trainings Extensions SDK Community Open Source Preview Program Newsletter Pricing Personal Pro Team Business Premium Support and TAM Pricing FAQ Contact Sales Company About Us What is a Container Blog Why Docker Trust Customer Success Partners Events Docker System Status Newsroom Swag Store Brand Guidelines Trademark Guidelines Careers Contact Us Languages English 日本語 © 2026 Docker Inc. All rights reserved Terms of Service Privacy Legal Cookie Settings",
      "crawl_timestamp": "2026-01-19T22:18:00.424697",
      "isActive": true
    },
    {
      "website": "https://www.docker.com",
      "section": "case_study",
      "content": "Customer Stories Real-life stories. Powered by Docker. Celebrating developers and organizations reaching their potential How Ataccama Accelerated Its AI Journey with Docker by Delighting Developers Problem Outdated infrastructure needed updated for business cloud agility, scalability, and security with modern AI requirements. Solution Update monolithic infrastructure to containerized approach with Docker Business. Products Docker Desktop Docker Hub Read more See more stories 200+ Global customers 75% Faster deployment 40% Reduction in servers How Docker Transforms Software Delivery at The Warehouse Group Problem Long setup times, inconsistent environments, and slow deployment cycles. Solution Streamline dev environments by transitioning from VMs to Docker containers. Products Docker Desktop Docker Extensions Read more See more stories 52,000 Developer hours saved 60 sec Deployment time (down from weeks) 8 months To realize ROI How Docker Accelerates ZEISS Microscopy’s AI Journey Problem Need for consistent and efficient AI model deployment across multiple platforms. Solution Adoption of Docker Business for seamless AI model and code deployment. Products Docker Desktop Read more See more stories AI models Improved consistency 48,000+ Employees GPU Access Supports Linux-based containers on Windows Walmart’s Practical Guide to ML Web App Deployment Using Docker and Kubernetes Problem In early development, the data science team at Walmart would often directly deploy container files to Kubernetes, increasing time spent identifying and debugging issues. Solution Leveraging Docker Desktop to easily test functions and explore configurations and experimentations to prevent major code, Docker configuration or cluster-related issues. Products Docker Desktop Read more See more stories 10,000+ Walmart Global Tech employees ML Ops Integrate ML into business apps Flask Application packaging Testing Strategies for Developer Efficiency at Netflix Problem Aubrey Chipman and Roberto Perez Alcolea from Netflix discuss challenges to developer productivity by addressing frequent interruptions, slow builds, and flaky tests Solution Implement Docker and Testcontainers Cloud to optimize testing processes, reduce flaky tests, and reduce build times. Products Testcontainers Watch now See more stories 850,000 Builds monthly ~14 Million Test cases each month Flow state focus Reducing interruptions Justin Cormack Highlights Docker-Microsoft Synergy at Build 2024 Problem Developers often face inefficiencies with disjointed tools and environments, slowing down project timelines and increasing frustration. Solution Justin Cormack demonstrated at Build 2024 how Docker Desktop and Microsoft Dev Box unify development environments, boosting efficiency and productivity. Products Docker Desktop Microsoft Dev Box Watch now See more stories Unifed workflows Efficient development integration Windows on ARM Streamlined environments Global usage Popular dev solutions Community stories Discover more ways developers use Docker Itaú Unibanco As Latin America’s largest private bank, Itaú Unibanco set a bold goal: migrate 100% of its infrastructure to the cloud by 2028. With operations in 18 countries and over 4,000 developers actively working in containers, the stakes were high and the transformation complex. Moving infrastructure to the cloud would modernize its operations across 18 countries, improve agility, and support faster digital product delivery. Read now InCred InCred Group is a diversified financial services firm headquartered in Mumbai, boasting a workforce of over 3500+ employees and 170+ branches across India. Founded in 2017, InCred set out to deliver inclusive finance to underserved sectors in India. Read now NTT DATA INTRAMART NTT DATA INTRAMART, born from an internal venture at NTT Data, is a recognized leader in enterprise digital transformation through its low-code platform “intra-mart.” With over 10,000 customers and the top domestic share in workflow/BPM for 17 consecutive years, NTT DATA INTRAMART delivers agility without compromising control. Read now How Siimpl Reduced Build Times by 90% with Docker Build Cloud and GitHub Actions Operational inefficiencies are common across all industries and company sizes, but these issues can be particularly acute in the cybersecurity sector. Siimpl, a cloud-first solutions provider, assisted an East Coast-based cybersecurity company in overcoming significant bottlenecks in its engineering operations. Read now How Exodus Orbitals Simplifies Satellite and Space Prototyping with Docker Exodus Orbitals offers a “satellite-as-a-service” platform, allowing businesses and developers to host and run satellite applications in space. The company provides rentable satellite services, allowing users to develop, test, and deploy satellite software without needing costly hardware, thereby lowering entry barriers. Read now How Docker IT Deploys Docker Desktop At Docker, we’re constantly looking for ways to improve how we develop and deploy applications. As a leading company in containerization technology, we strive to simplify complex workflows, enhance the developer experience, and accelerate innovation. Read now Overcoming Insurmountable Debt with Stride Conductor GenAI and Docker at a leading US e-commerce company Stride was approached by a leading American e-commerce company, dominating its sector with an annual revenue of $8 billion. Faced with a critical technical challenge, their PHP codebase had accumulated over 17,000 linting errors. Read now How a Beauty Giant Achieved 25% Cost Savings with Container-First Development As a global leader in the beauty and personal care industry, this company’s growth was feeling the impact of its outdated, monolithic infrastructure. With increasing digital demands, the company faced significant challenges — deployment cycles dragged on and inconsistencies across development environments led to delays and errors. Read now Why Bitso Returned to Docker Business: Security, Efficiency, and Developer Experience Bitso, the leading financial services company powered by cryptocurrency in Latin America, is known for making crypto accessible, secure, and easy to use. Read now How JWP Balances Dev and Security Priorities with Docker Scout JWP, a pioneer in video streaming and player technology, empowers publishers and broadcasters with an end-to-end platform for delivering and monetizing exceptional video content across web, OTT applications, and CTV platforms. Serving more than 7,000 clients globally, JWP powers video for more than 1 billion users and generates over 9 billion impressions and 8 billion video plays each month. Read now PCI Compliance Certification with Docker Scout at Distilled Distilled, a prominent Irish company, manages four major online marketplaces: Daft.ie, DoneDeal.ie, Adverts.ie, and Gumtree.ie. With a long-standing market presence, particularly with Daft.ie, which has led the market for over 20 years, Distilled is a key player in Ireland’s online marketplace sector. Read now How Kapa.ai Achieved Super-Fast, Production-Ready Local Environments with Docker Kapa.ai enables developer-facing companies to create AI-powered support and onboarding bots, enhancing developer experience and reducing support efforts. Read now Find a subscription that’s right for you Contact an expert today to find the perfect balance of collaboration, security, and support with a Docker subscription. Contact sales",
      "crawl_timestamp": "2026-01-19T22:18:00.424697",
      "isActive": true
    },
    {
      "website": "https://www.github.com",
      "section": "navbar",
      "content": "PlatformAI CODE CREATIONGitHub CopilotWrite better code with AIGitHub SparkBuild and deploy intelligent appsGitHub ModelsManage and compare promptsMCP RegistryNewIntegrate external toolsDEVELOPER WORKFLOWSActionsAutomate any workflowCodespacesInstant dev environmentsIssuesPlan and track workCode ReviewManage code changesAPPLICATION SECURITYGitHub Advanced SecurityFind and fix vulnerabilitiesCode securitySecure your code as you buildSecret protectionStop leaks before they startEXPLOREWhy GitHubDocumentationBlogChangelogMarketplaceView all featuresSolutionsBY COMPANY SIZEEnterprisesSmall and medium teamsStartupsNonprofitsBY USE CASEApp ModernizationDevSecOpsDevOpsCI/CDView all use casesBY INDUSTRYHealthcareFinancial servicesManufacturingGovernmentView all industriesView all solutionsResourcesEXPLORE BY TOPICAISoftware DevelopmentDevOpsSecurityView all topicsEXPLORE BY TYPECustomer storiesEvents & webinarsEbooks & reportsBusiness insightsGitHub SkillsSUPPORT & SERVICESDocumentationCustomer supportCommunity forumTrust centerPartnersOpen SourceCOMMUNITYGitHub SponsorsFund open source developersPROGRAMSSecurity LabMaintainer CommunityAcceleratorArchive ProgramREPOSITORIESTopicsTrendingCollectionsEnterpriseENTERPRISE SOLUTIONSEnterprise platformAI-powered developer platformAVAILABLE ADD-ONSGitHub Advanced SecurityEnterprise-grade security featuresCopilot for BusinessEnterprise-grade AI featuresPremium SupportEnterprise-grade 24/7 supportPricing",
      "crawl_timestamp": "2026-01-19T22:17:46.826517",
      "isActive": true
    },
    {
      "website": "https://www.github.com",
      "section": "homepage",
      "content": "Explore the latest tools from Universe '25 The future of building happens togetherTools and trends evolve, but collaboration endures. With GitHub, developers, agents, and code come together on one platform.Enter your emailSign up for GitHubTry GitHub Copilot freeGitHub featuresA demonstration animation of a code editor using GitHub Copilot Chat, where the user requests GitHub Copilot to refactor duplicated logic and extract it into a reusable function for a given code snippet.CodePlanCollaborateAutomateSecureCodeWrite, test, and fix code quickly with GitHub Copilot, from simple boilerplate to complex features.GitHub customersAmerican AirlinesDuolingoErnst and YoungFordInfoSysMercado LibreMercedes-BenzShopifyPhilipsSociété GénéraleSpotifyVodafoneAmerican AirlinesDuolingoErnst and YoungFordInfoSysMercado LibreMercedes-BenzShopifyPhilipsSociété GénéraleSpotifyVodafoneAccelerate your entire workflowFrom your first line of code to final deployment, GitHub provides AI and automation tools to help you build and ship better software faster.A Copilot chat window with the 'Ask' mode enabled. The user switches from 'Ask' mode to 'Agent' mode from a dropdown menu, then sends the prompt 'Update the website to allow searching for running races by name.' Copilot analyzes the codebase, then explains the required edits for three files before generating them. Copilot then confirms completion and summarizes the implemented changes for the new functionality allowing users to search races by name and view paginated, filtered results.Your AI partner everywhere. Copilot is ready to work with you at each step of the software development lifecycle.Explore GitHub CopilotDuolingo boosts developer speed by 25% with GitHub CopilotRead customer story2025 Gartner® Magic Quadrant™ for AI Code AssistantsRead industry reportAutomate your path to productionShip faster with secure, reliable CI/CD.Explore GitHub ActionsCode instantly from anywhereLaunch a full, cloud-based development environment in seconds.Explore GitHub CodespacesKeep momentum on the goManage projects and assign tasks to Copilot, all from your mobile device.Explore GitHub MobileShape your toolchainExtend your stack with apps, actions, and AI models.Explore GitHub MarketplaceBuilt-in application security where found means fixedUse AI to find and fix vulnerabilities so your team can ship more secure software faster.Apply fixes in seconds. Spend less time debugging and more time building features with Copilot Autofix.Explore GitHub Advanced SecuritySecurity debt, solved. Leverage security campaigns and Copilot Autofix to reduce application vulnerabilities.Learn about GitHub Code SecurityDependencies you can depend on. Update vulnerable dependencies with supported fixes for breaking changes.Learn about DependabotYour secrets, your business. Detect, prevent, and remediate leaked secrets across your organization.Learn about GitHub Secret Protection70% MTTR reduction with Copilot Autofix8.3M secret leaks stopped in the past 12 months with push protectionWork together, achieve moreFrom planning and discussion to code review, GitHub keeps your team’s conversation and context next to your code.Plan with clarity. Organize everything from high-level roadmaps to everyday tasks.Explore GitHub Projects“It helps us onboard new software engineers and get them productive right away. We have all our source code, issues, and pull requests in one place... GitHub is a complete platform that frees us from menial tasks and enables us to do our best work.Fabian FaulhaberApplication manager at Mercedes-BenzKeep track of your tasksCreate issues and manage projects with tools that adapt to your code.Explore GitHub IssuesShare ideas and ask questionsCreate space for open-ended conversations alongside your project.Explore GitHub DiscussionsReview code changes togetherAssign initial reviews to Copilot for greater speed and quality.Explore code reviewFund open source projectsBecome an open source partner and support the tools and libraries that power your work.Explore GitHub SponsorsFrom startups to enterprises, GitHub scales with teams of any size in any industry.By industryBy sizeBy use caseBy industryTechnologyFigma streamlines development and strengthens securityRead customer storyAutomotiveMercedes-Benz standardizes source code and automates onboardingRead customer storyFinancial servicesMercado Libre cuts coding time by 50%Read customer storyExplore customer storiesView all solutionsMillions of developers and businesses call GitHub homeWhether you’re scaling your development process or just learning how to code, GitHub is where you belong. Join the world’s most widely adopted developer platform to build the technologies that shape what’s next.Enter your emailSign up for GitHubTry GitHub Copilot free",
      "crawl_timestamp": "2026-01-19T22:17:46.826517",
      "isActive": true
    },
    {
      "website": "https://www.github.com",
      "section": "footer",
      "content": "Site-wide Links Subscribe to our developer newsletter Get tips, technical guides, and best practices. Twice a month. Subscribe Platform Features Enterprise Copilot AI Security Pricing Team Resources Roadmap Compare GitHub Ecosystem Developer API Partners Education GitHub CLI GitHub Desktop GitHub Mobile GitHub Marketplace MCP Registry Support Docs Community Forum Professional Services Premium Support Skills Status Contact GitHub Company About Why GitHub Customer stories Blog The ReadME Project Careers Newsroom Inclusion Social Impact Shop © 2026 GitHub, Inc. Terms Privacy (Updated 02/2024)02/2024 Sitemap What is Git? Manage cookies Do not share my personal information GitHub on LinkedIn Instagram GitHub on Instagram GitHub on YouTube GitHub on X TikTok GitHub on TikTok Twitch GitHub on Twitch GitHub’s organization on GitHub English English Português (Brasil) Español (América Latina) 日本語 한국어",
      "crawl_timestamp": "2026-01-19T22:17:46.826517",
      "isActive": true
    },
    {
      "website": "https://www.github.com",
      "section": "case_study",
      "content": "Customer Stories Enterprise Team All stories Start a free trial GitHub Enterprise Duolingo empowers its engineers to be force multipliers for expertise with GitHub Copilot. 25% increase in developer speed with GitHub Copilot 1m set-up time for largest repo with Codespaces 67% decrease in median code review turnaround time 70% increase in pull requests Play video How GitHub Copilot Optimizes Duolingo's Language Teaching Number of Seats 300 Location Pittsburgh, PA Problem Inconsistent standards and workflows limited developer mobility and efficiency, limiting Duolingo’s ability to expand its content and deliver on its core mission. Solution GitHub Copilot, Codespaces, and custom API integrations enforce code consistency, accelerate developer speed, and remove the barriers to using engineering as a force multiplier for expertise. Products GitHub Enterprise GitHub Codespaces GitHub Copilot Learning a language can not only be difficult, but it can be expensive, too. This is a vicious cycle for many people: while learning a new language could open up new opportunities to increase their income and improve their lives, they can’t afford it. In 2011, Duolingo set out to change this by offering its users a free way to learn another language, and since then, it has grown to become the world’s most popular way to do so. But the company’s mission doesn't end there—it also wants to build the best education platform in the world and to make it universally available to anyone who needs it. At first, Duolingo’s developers focused on building its mobile applications and infrastructure, but the company quickly realized it needed to augment its engineering prowess with experts in topics like second language acquisition and language learning pedagogy. Now, with more than 500 million users, Duolingo has gathered unprecedented data insights into how people learn. Its developers use this data to work alongside teams of language learning scientists, machine learning engineers, and AI experts to constantly improve its platform. “At Duolingo, we use engineering as a force multiplier for expertise,” says Jonathan Burket, a senior engineering manager at Duolingo. In order to be force multipliers, Duolingo’s 300 developers need to be as efficient as possible in their jobs and not spend time on unrelated tasks or distractions. Duolingo relies on GitHub Enterprise to keep its developers nimble and focused, heavily leveraging GitHub's APIs and tools like Codespaces and GitHub Copilot. Duolingo has used GitHub for source code management since 2011, when GitHub offered little more than code hosting and collaboration capabilities. At the time, Duolingo relied on different third-party products like Gerrit and PullApprove for code review and other functionality, and this left the company’s three primary repositories with widely varying cultures and pull request processes. This was a source of inefficiency and prevented developers from easily moving from one repository to another. But as GitHub added new functionality, Duolingo adopted it and moved off of third-party tools, increasingly putting GitHub at the core of its development processes. And when Duolingo’s needs differed from the offered functionality, the company turned to GitHub’s APIs to standardize workflows across its repos and projects using a custom GitHub bot implementation. For example, one Slack integration has dropped the median turnaround time for code review from three hours to one. “GitHub enables us to enforce consistency and a standardized engineering culture that makes internal mobility easier,” explains Burket. Since building out this integration, Duolingo has moved toward a microservice architecture and has grown from three repositories to 400. The integration has made it simple for teams to contribute to each other's projects, and has even allowed non-technical employees to make small code changes without jeopardizing quality. At the same time, Duolingo has built further customizations using the GitHub API to ensure its developers are properly testing their code before deploying, helping to avoid problems and improve site stability. “GitHub has one of the more powerful APIs that I've worked with,” says Art Chaidarun, a principal software engineer at Duolingo. “It allows us to build whatever we need ourselves so that we can focus on our actual business needs and business logic, rather than building infrastructure that GitHub can handle.” The team has also accelerated their workflow with their recent adoption of GitHub Copilot, an AI-powered pair programmer that provides autocomplete-style suggestions to developers while they code. The tool offers two ways for developers to receive suggestions: by starting to write the code they want to use or by writing natural language comments that describe what they want the code to do. Duolingo CTO Severin Hacker says that GitHub Copilot is not only quick and easy to adopt for companies already using GitHub, but it also delivers immediate benefits, especially for enterprises with sprawling codebases. A tool like GitHub Copilot is so impactful at large companies because suddenly engineers can make impactful changes to other developers’ code with little previous exposure. \"GitHub Copilot works with all of our other code development tools, and enabling it across the entire organization is as simple as checking a box,” says Hacker. “A tool like GitHub Copilot is so impactful at large companies because suddenly engineers can make impactful changes to other developers’ code with little previous exposure.\" Burket sees this as enabling developers to do their best work, instead of getting caught up on the little details. ”GitHub Copilot stops you from getting distracted when you’re doing deep work that requires a lot of your brain power. You spend less time on routine work and more time on the hard stuff,” says Burket. “With GitHub Copilot, our developers stay in the flow state and keep momentum instead of clawing through code libraries or documentation.” With GitHub Copilot, our developers stay in the flow state and keep momentum instead of clawing through code libraries or documentation. Burket explains that GitHub Copilot has increased developer productivity by limiting context switching, reducing the need to manually produce boilerplate code, and in turn helping developers stay focused on solving complex business challenges. “Boilerplate code is where Copilot is very, very effective. You can practically tab complete the basic class or function using Copilot,” says Burket. For developers who are new to working with a specific repository or framework, for example, Burket estimates at least a 25% increase in developer speed, and a 10% increase for those already familiar with that same codebase, who can more quickly and easily create boilerplate code. Part of this increase in developer velocity comes from the fact that GitHub Copilot’s suggestions can be built with the context of your codebase. “GitHub Copilot is unique in the sense that it looks at the context of the rest of your work and incorporates that context into its recommendations. Other tools don’t have that contextual awareness,” says Hacker. “I don’t know of anything available today that’s remotely close to what we can get with GitHub Copilot.” Duolingo has also found efficiency and consistency in Codespaces, GitHub’s cloud-based development environment. When some of its developers had issues running Docker locally on their new Apple M1 machines, Codespaces offered a way to skip the local environment troubleshooting and offer a 1-click environment setup. The power and efficiency of Codespaces motivated teams within Duolingo to move entirely to Codespaces. “With Codespaces, you don't need to waste a day or a week setting up each individual repository. Instead, you can get started within a few minutes,” says Chaidarun. Now, setting up Duolingo’s largest repo takes just one minute, as opposed to hours or even days before Codespaces. “Codespaces is great for maintenance too. When a developer gets into a weird state, they can just rebuild their Codespace to start fresh and get back to work. Otherwise, they might spend hours trying to fix what went wrong with their environment.” When first presented with Codespaces, Burket says that he had some initial hesitation around giving up control, as might any developer, but that he was quickly won over. “I wanted to be in full control of my experience. I thought, 'I don't need this tool to SSH into another machine to handle my problems,’” said Burket. “But I'm a believer now. I thought I’d have to compromise on a lot of things by running remotely, but that hasn’t been the case.” Codespaces has enabled teams to configure a standardized, yet customizable environment, making it easy for Duolingo to onboard developers faster into new projects. Engineering time is the most valuable resource at Duolingo. Making the best use of that time with the help of GitHub Copilot and Codespaces enables us to reach our goals faster. Whether GitHub Copilot, Codespaces, or custom integrations built with GitHub’s APIs, GitHub allows Duolingo’s developers to spend more time on improving the product experience and developing new apps and learning content, instead of getting distracted dealing with daily minutiae. “Engineering time is the most valuable resource at Duolingo,” says Chaidarun. “Making the best use of that time with the help of GitHub Copilot and Codespaces enables us to reach our goals faster.” Interested in bringing GitHub Enterprise to your organization? Start your free trial of GitHub Enterprise for 30 days and increase your team's collaboration. $21 per user/month after trial expires. Curious about other plans? from GitHub Explore more from GitHub The ReadME Project Stories and voices from the developer community. Learn more about The ReadME Project GitHub Copilot AI pair programmer that helps you write code faster. Learn more about GitHub Copilot Executive Insights Get expert perspectives. Stay ahead with insights from industry leaders. Learn more about Executive Insights What will your story be? Start collaborating with your team on GitHub Free The basics for individuals and organizations $0 USD per month Create a free organization Team Advanced collaboration for individuals and organizations $4 USD per month Continue with Team Enterprise Security, compliance, and flexible deployment $21 USD per month Enterprise Want to use GitHub on your own? Check out our plans for individuals",
      "crawl_timestamp": "2026-01-19T22:17:46.826517",
      "isActive": true
    },
    {
      "website": "https://www.linux.org",
      "section": "navbar",
      "content": "Menu Home Forums New posts Search forums What's new Featured content New posts New profile posts Latest activity Linux Tutorials Beginner Tutorials Intermediate Tutorials Advanced Tutorials Members Current visitors New profile posts Search profile posts Download Linux Linux News Credits Transactions Credits: 0 Log in Register What's new Search Search Search titles only By: Search Advanced search…",
      "crawl_timestamp": "2026-01-19T22:17:32.248503",
      "isActive": true
    },
    {
      "website": "https://www.linux.org",
      "section": "homepage",
      "content": "Home You are using an out of date browser. It may not display this or other websites correctly.You should upgrade or use an alternative browser. Linux.org Home Top",
      "crawl_timestamp": "2026-01-19T22:17:32.248503",
      "isActive": true
    },
    {
      "website": "https://www.linux.org",
      "section": "footer",
      "content": "Default Style Rob's Backyard BBQ: Rob's BBQ stuff Contact us Terms and rules Privacy policy Help Home RSS Community platform by XenForo® © 2010-2025 XenForo Ltd. Parts of this site powered by add-ons from DragonByte™ ©2011-2026 DragonByte Technologies (Details)",
      "crawl_timestamp": "2026-01-19T22:17:32.248503",
      "isActive": true
    },
    {
      "website": "https://www.linux.org",
      "section": "case_study",
      "content": "",
      "crawl_timestamp": "2026-01-19T22:17:32.248503",
      "isActive": true
    },
    {
      "website": "https://www.mozilla.org",
      "section": "navbar",
      "content": "Menu Firefox browsers Products Close Products menu Mozilla VPN Mozilla Monitor Firefox Relay MDN Plus Thunderbird All products About us Close About us menu Our Mission About Mozilla The Mozilla Manifesto Get Involved Blog Our Work Mozilla Foundation Mozilla.ai Mozilla Ventures Mozilla Advertising Mozilla Builders Mozilla New Products",
      "crawl_timestamp": "2026-01-19T22:17:26.537159",
      "isActive": true
    },
    {
      "website": "https://www.mozilla.org",
      "section": "homepage",
      "content": "Choose your language or locale to browse Mozilla.org It is available in the following languages: Acholi عربي Asturianu Беларуская Български Brezhoneg Bosanski Català Maya Kaqchikel Čeština Cymraeg Dansk Deutsch Dolnoserbšćina Ελληνικά English (Canadian) English (British) English (US) Esperanto Español (de Argentina) Español (de Chile) Español (de España) Español (de México) Euskara suomi Français Frysk Gàidhlig Galego Avañe'ẽ עברית हिन्दी (भारत) Hrvatski Hornjoserbsce magyar Interlingua Bahasa Indonesia íslenska Italiano 日本語 ქართული Taqbaylit Қазақ ខ្មែរ 한국어 ພາສາລາວ Македонски മലയാളം Melayu မြန်မာဘာသာ Norsk bokmål Nederlands Norsk nynorsk ਪੰਜਾਬੀ (ਭਾਰਤ) Polski Português (do Brasil) Português (Europeu) rumantsch Română Русский Sicilianu Scots සිංහල slovenčina سرائیکی Slovenščina Shqip Српски Svenska Тоҷикӣ ไทย Tagalog Türkçe Triqui Українська Tiếng Việt 中文 (简体) 正體中文 (繁體)",
      "crawl_timestamp": "2026-01-19T22:17:26.537159",
      "isActive": true
    },
    {
      "website": "https://www.mozilla.org",
      "section": "footer",
      "content": "Add trust to your ad buy. Learn more about Mozilla Ads Company Leadership Press Center Careers Contact Support Product Help File a Bug Localize Mozilla Security Developers Developer Edition Enterprise Tools MDN Firefox Release Notes Follow @Mozilla Bluesky (@mozilla.org) Instagram (@mozilla) LinkedIn (@mozilla) TikTok (@mozilla) Spotify (@mozilla) Follow @Firefox Bluesky (@firefox.com) Instagram (@firefox) YouTube (@firefoxchannel) TikTok (@firefox) Donate Visit Mozilla Corporation’s not-for-profit parent, Mozilla Foundation. Portions of this content are ©1998–2026 by individual mozilla.org contributors. Content available under a Creative Commons license. Website Privacy Notice Cookies Legal Community Participation Guidelines About this site",
      "crawl_timestamp": "2026-01-19T22:17:26.537159",
      "isActive": true
    },
    {
      "website": "https://www.mozilla.org",
      "section": "case_study",
      "content": "",
      "crawl_timestamp": "2026-01-19T22:17:26.537159",
      "isActive": true
    },
    {
      "website": "https://www.nginx.com",
      "section": "navbar",
      "content": "Solutionsview allWeb Application and API ProtectionHybrid Multicloud Application DeliverySecure Multicloud NetworkingPost-Quantum Cryptography ReadinessEnterprise AI Delivery & SecurityApplication MigrationApplication ModernizationZero Trust ArchitectureBanking and Financial ServicesPublic Sector SolutionsHealthcareService ProvidersE-commerceTechnologyRed HatNutanixNVIDIANetAppF5 on Amazon Web ServicesF5 on Google Cloud PlatformF5 on Microsoft AzureProductsview allAI Data DeliveryAI Factory Load BalancingAI Runtime SecurityAI Multicloud NetworkingLoad BalancingHybrid Multicloud NetworkingUnified Management and AutomationContent Delivery Network (CDN)Enterprise DNSAPI GatewayAccess Control ManagementAPI SecurityBot Management and Security ServicesClient-side ProtectionDDoS ProtectionNetwork Firewall Security ManagementSSL / TLS OrchestrationSecure Web Gateway ServicesUnified Management and AutomationWAF SolutionsWeb Application ScannerEnterprise Networking HardwareTelecom Networking and OptimizationPartnersview allFind a Reseller PartnerTechnology AlliancesF5 Partner ProgramsPartner CentralNGINX Consulting PartnersResourcesview allArticlesBlogCase StudiesGlossaryOffice of the CTOReportsWebinarsWhite PapersProduct CertificationsProduct Datasheets Solution ProfilesAPI DocumentationDeployment GuidesIntegration GuidesKB ArticlesProduct DocumentationReference ArchitecturesDemo CenterInfographicsVisio StencilsF5 DevCentral CommunityF5 LabsDownloadsSupport PortalProfessional CertificationsTrainingEnterprise AI Delivery and SecurityWebinarsCustomer Case StudiesSupportview allSupport PortalProfessional ServicesActivate Registration KeysBug trackerCreate a Service RequestSoftware DownloadsCommercial Software UpdatesCommercial Product DocumenationOpen Source Product Updates and DocumenationDocumentationQuick StartSystem StatusFeature RequestsComplianceF5 DevCentral CommunityF5 LabsCompanyview allAbout F5LeadershipDiversity & InclusionF5 Global GoodCareersContact InformationF5 Trust CenterInvestor RelationsBlogPress ReleasesEventsAwardsPress KitGet F5view allFree Product TrialsDemo CenterCompare F5 Distributed Cloud ServicesF5 NGINX Products and PackagingProfessional ServicesSubscriptionFlex Consumption ProgramPerpetual Licensing (GBB)English中文DeutschEspañolFrançais日本語한국어PortuguêsF5 DevCentral CommunityF5 LabsMyF5Partner CentralEducation Services Portal (ESP)Contact F5 SalesContact F5 SupportContact Professional ServicesContact F5 Distributed Cloud ServicesF5 Distributed Cloud ServicesBIG-IP VE and BIG-IQ Centralized Management VENGINX One",
      "crawl_timestamp": "2026-01-19T22:17:37.698683",
      "isActive": true
    },
    {
      "website": "https://www.nginx.com",
      "section": "homepage",
      "content": "An Architecture for Modern ApplicationsF5 NGINX provides a suite of products that together form the core of what organizations need to create apps and APIs with performance, reliability, security, and scale.ProductsModernize apps at scale with high-performance app delivery spanning monoliths to microservices.NGINX OneThe core NGINX data plane software enhanced with SaaS-based tools for observability, management, and security.F5 WAF for NGINX and F5 DoS for NGINXComprehensive WAF security and denial-of-service (DoS) defense solutions designed to protect apps and APIs from layer 7 attacks. NGINXaaS for Azure An Infrastructure-as-a-Service version of NGINX that enables you to deliver secure and high-performance apps, deployed straight from the Azure Marketplace.F5 NGINXaaS for Google CloudEnhance app delivery and security in Google Cloud without the operational toil: Accelerate performance, strengthen protection, and improve visibility at scale, while keeping costs optimized. NGINX One Components NGINX PlusAn all-in-one, cloud-native load balancer, reverse proxy, web server, content cache, and API gateway.F5 WAF for NGINXA comprehensive WAF security solution designed to protect apps and APIs from layer 7 attacks.NGINX Instance ManagerIdentify, secure, manage, and monitor all NGINX Open Source and NGINX Plus instances in your organization.NGINX Ingress ControllerImplements unified API gateways, load balancers, and ingress controllers across Kubernetes environments and provides insights into app health and performance.NGINX Gateway FabricStreamlines app, service, and API connectivity across hybrid and multicloud Kubernetes environments with a unified app delivery fabric.NGINX One ConsoleConfigure, secure, monitor and manage NGINX instances at scale with NGINX One management console.Awards and Recognition2024 TrustRadius Top Rated Award ResourcesFeaturedThe Complete NGINX CookbookWith new and updated recipes for 2024, this free O'Reilly eBook is better than ever. Get how-to advice and sample NGINX configurations for load balancing, cloud deployment, automation, containers and microservices, service mesh, security, and more.Read the eBookBlogsOur Design Vision for NGINX One: The Ultimate Data Plane SaaS ›Dynamic A/B Kubernetes Multi-Cluster Load Balancing and Security Controls with NGINX Plus ›The Mission-Critical Patient-Care Use Case That Became a Kubernetes Odyssey › WebinarsGet Hands-On with NGINX and QUIC+HTTP/3 › Open source resourcesGitHub Code Repositories ›NGINX Open Source › NGINX Open Source vs NGINX One: differences in features ›NGINX One to NGINX Open Source › Related use casesOptimize, Scale, and Secure API Communications ›Optimize, Scale, and Secure AI Interactions ›Optimize, Scale, and Secure Cloud-Native, Modern Applications ›Optimize, Scale, and Secure Apps in Kubernetes › Next StepsDeliver and Secure Every AppF5 application delivery and security solutions are built to ensure that every app and API deployed anywhere is fast, available, and secure. Learn how we can partner to deliver exceptional experiences every time.WHAT WE OFFERWHAT WE OFFERRESOURCESRESOURCESSUPPORTSUPPORTPARTNERSPARTNERSCOMPANYCOMPANYConnect With Us©2026 F5, Inc. All Rights Reserved",
      "crawl_timestamp": "2026-01-19T22:17:37.698683",
      "isActive": true
    },
    {
      "website": "https://www.nginx.com",
      "section": "footer",
      "content": "",
      "crawl_timestamp": "2026-01-19T22:17:37.698683",
      "isActive": true
    },
    {
      "website": "https://www.nginx.com",
      "section": "case_study",
      "content": "By solution areaBy industryWeb application and API protectionProtect your entire digital footprint with comprehensive, consistent security. Simplify defense and reduce risk across hybrid and multicloud environments with F5.Enterprise AI delivery and securityDeliver and secure AI applications and workflows, optimizing performance and unlocking the full potential of enterprise AI deployments.Hybrid multicloud application deliveryReduce complexity and mitigate risk across hybrid and multicloud environments. Connect and secure workloads anywhere, providing exceptional digital experiences.Application migrationStreamline your application migrations to ensure minimal downtime, consistent security, and seamless integration across different environments.Application modernizationEnable cloud-native modernization, minimizing complexity and optimizing delivery, security, and observability for Kubernetes environments.Post-quantum cryptography readinessProtect sensitive data from quantum threats like “harvest now, decrypt later” with NIST-standardized post-quantum cryptography for modern and legacy apps—wherever they run. Zero trust architectureEnable zero trust security across hybrid, multicloud, and AI environments. Defend applications, APIs, and data with deep visibility, access controls, and seamless monitoring.Deliver and Secure Every AppF5 application delivery and security solutions are built to ensure that every app and API deployed anywhere is fast, available, and secure. Learn how we can partner to deliver exceptional experiences every time.WHAT WE OFFERWHAT WE OFFERRESOURCESRESOURCESSUPPORTSUPPORTPARTNERSPARTNERSCOMPANYCOMPANYConnect With Us©2026 F5, Inc. All Rights Reserved",
      "crawl_timestamp": "2026-01-19T22:17:37.698683",
      "isActive": true
    },
    {
      "website": "https://www.processed",
      "section": "navbar",
      "content": "",
      "crawl_timestamp": "",
      "isActive": true
    },
    {
      "website": "https://www.processed",
      "section": "homepage",
      "content": "",
      "crawl_timestamp": "",
      "isActive": true
    },
    {
      "website": "https://www.processed",
      "section": "footer",
      "content": "",
      "crawl_timestamp": "",
      "isActive": true
    },
    {
      "website": "https://www.processed",
      "section": "case_study",
      "content": "",
      "crawl_timestamp": "",
      "isActive": true
    },
    {
      "website": "https://www.python.org",
      "section": "navbar",
      "content": "Skip to content ▼ Close Python PSF Docs PyPI Jobs Community ▲ The Python Network",
      "crawl_timestamp": "2026-01-19T22:17:16.455088",
      "isActive": true
    },
    {
      "website": "https://www.python.org",
      "section": "homepage",
      "content": "Get Started Whether you're new to programming or an experienced developer, it's easy to learn and use Python. Start with our Beginner’s Guide Download Python source code and installers are available for download for all versions! Latest: Python 3.14.2 Docs Documentation for Python's standard library, along with tutorials and guides, are available online. docs.python.org Jobs Looking for work or have a Python related position that you're trying to hire for? Our relaunched community-run job board is the place to go. jobs.python.org Latest News More 2026-01-14 Python 3.15.0 alpha 5 (yes, another alpha!) 2026-01-13 Python 3.15.0 alpha 4 2026-01-13 Anthropic invests $1.5 million in the Python Software Foundation and open source security 2026-01-08 PSF News: $500K+ Raised for Python for Everyone, PyCon US, & More! 2025-12-16 Python 3.15.0 alpha 3 Upcoming Events More 2026-01-21 IndyPy: Python Meets Microcontrollers 2026-01-22 Python Leiden User Group 2026-01-27 PyLadies Amsterdam: Robotics beginner class with MicroPython 2026-01-31 Python Devroom @ FOSDEM 2026 2026-02-20 PyCon Namibia 2026 Success Stories More \"Some of the things [SonarCloud] spots are impressive (probably driven by some introspection and/or type inference), not just the simple pattern matching that I am used to in most of the flake8 ecosystem.\" - Peter J. A. Cock - maintainer of BioPython Deliver Clean and Safe Code for Your Python Applications by Kirti Joshi, Nicolas Bontoux Use Python for… More Web Development: Django, Pyramid, Bottle, Tornado, Flask, Litestar, web2py GUI Development: tkInter, PyGObject, PyQt, PySide, Kivy, wxPython, DearPyGui Scientific and Numeric: SciPy, Pandas, IPython Software Development: Buildbot, Trac, Roundup System Administration: Ansible, Salt, OpenStack, xonsh >>> Python Software Foundation The mission of the Python Software Foundation is to promote, protect, and advance the Python programming language, and to support and facilitate the growth of a diverse and international community of Python programmers. Learn more Become a Member Donate to the PSF",
      "crawl_timestamp": "2026-01-19T22:17:16.455088",
      "isActive": true
    },
    {
      "website": "https://www.python.org",
      "section": "footer",
      "content": "▲ Back to Top About Applications Quotes Getting Started Help Python Brochure Downloads All releases Source code Windows macOS Android Other Platforms License Alternative Implementations Documentation Docs Audio/Visual Talks Beginner's Guide FAQ Non-English Docs PEP Index Python Books Python Essays Community Diversity Mailing Lists IRC Forums PSF Annual Impact Report Python Conferences Special Interest Groups Python Logo Python Wiki Code of Conduct Community Awards Get Involved Shared Stories Success Stories Arts Business Education Engineering Government Scientific Software Development News Python News PSF Newsletter PSF News PyCon US News News from the Community Events Python Events User Group Events Python Events Archive User Group Events Archive Submit an Event Contributing Developer's Guide Issue Tracker python-dev list Core Mentorship Report a Security Issue ▲ Back to Top Help & General Contact Diversity Initiatives Submit Website Bug Status Copyright ©2001-2026. Python Software Foundation Legal Statements Privacy Notice",
      "crawl_timestamp": "2026-01-19T22:17:16.455088",
      "isActive": true
    },
    {
      "website": "https://www.python.org",
      "section": "case_study",
      "content": "Newest success stories Python on Arm: 2025 Update Want to know how Python is performing on Arm across Linux, Windows, and the cloud? Our 2025 update highlights the latest JIT improvements, ecosystem milestones like GitHub runners and PyTorch on Windows, and the continued collaboration driving it all forward. Read more Using Python to build a solution for instant tokenized real estate redemptions Python programmability on Algorand makes the entire development lifecycle easier and means more affordable and efficient maintenance and upgrades going forward. Read more Zama Concrete ML: Simplifying Homomorphic Encryption for Python Machine Learning To simplify the adoption of FHE, which involves a complex and resource-intensive technological stack, Zama developed tools that streamline the integration of FHE into applications. Since Python is the de facto standard for building machine learning (ML) applications, it was an obvious choice to create an open-source FHE library in Python. Read more Building Robust Codebases with Python's Type Annotations Maintaining our ever-evolving Python codebase poses an intricate challenge: how do we make updates to reflect the changing rules and regulations of 200+ global markets without compromising access to the systems that our engineers and traders use on a daily basis? While an inner layer of shared business logic enables coherency in our codebase performance, it also means small regulatory changes can impact many systems. In this article, Python Engineer John Lekberg details how we use Python type annotations to minimize the time and risk involved in manual verification. Read more Newest success stories by category Arts See All Business Using Python to build a solution for instant tokenized real estate redemptions Lincoln Loop: Building a sustainable business inspired by Python’s ethos Using Python for commercial cloud backup Using Python to make unstable APIs reliable Python for Financial Machine Learning at Union Investment See All Data Science How HyperFinity Is Streamlining Its Serverless Architecture with Snowflake's Snowpark for Python Reimagining data science with Python-based operators in Einblick’s visual canvas Using Python with Gretel.ai to Generate Synthetic Location Data See All Education Elementary school education: Is it love or just Python? Using Python to Automate Tedious Tasks Python in the Blind Audio Tactile Mapping System See All Engineering Python for Collaborative Robots Abridging clinical conversations using Python Getting to Know Python See All Government Python Powered CrossCompute Report Automation for eReliability Tracker Leads to Cost and Time Savings for the American Public Power Association Saving the world with Open Data and Python Frequentis TAPtools® - Python in Air Traffic Control See All Scientific Why Python Matters for the VR Community Python for Collaborative Drug Discovery Python To Help Meteorologists Python for Scientific Data Visualization Simulating Biomolecules with Python See All Software Development Python on Arm: 2025 Update Zama Concrete ML: Simplifying Homomorphic Encryption for Python Machine Learning Building Robust Codebases with Python's Type Annotations Building a Dependency Graph of Our Python Codebase Bleeding Edge Dependency Testing Using Python See All Submit Yours! Python users want to know more about Python in the wild. Tell us your story",
      "crawl_timestamp": "2026-01-19T22:17:16.455088",
      "isActive": true
    },
    {
      "website": "https://www.stackoverflow.com",
      "section": "navbar",
      "content": "current community Stack Overflow help chat Meta Stack Overflow your communities Sign up or log in to customize your list. more stack exchange communities company blog Log in Sign up",
      "crawl_timestamp": "2026-01-19T22:17:53.009841",
      "isActive": true
    },
    {
      "website": "https://www.stackoverflow.com",
      "section": "homepage",
      "content": "Newest Questions Ask Question 24,178,407 questions Newest Active Bountied 11 Unanswered More Bountied 11 Unanswered Frequent Score Trending Week Month Unanswered (my tags) Filter Filter by No answers No upvoted or accepted answers No Staging Ground Has bounty Days old Sorted by Newest Recent activity Highest score Most frequent Bounty ending soon Trending Most activity Tagged with My watched tags The following tags: Apply filter Cancel 0 votes 0 answers 2 views How to scope Tailwind CSS build in a Micro Frontend to prevent CSS bleeding (Host vs. MFE) without Shadow DOM? I am building a Micro Frontend (MFE) using **React + Vite + Tailwind CSS + Shadcn + (dndKit , sonner) **. This MFE is being integrated into a legacy Laravel host application. The project is large (500+... reactjsvitepostcssmicro-frontendtailwind-css-3 Pavan Kumar KN 1 asked 4 mins ago 0 votes 0 answers 5 views Add variable to PATH using WiX Toolkit and JPackage I have built a console java application and I would like to be able to distribute it without requiring users to download a JRE. To do this I am using JPackage to build to an MSI (Also will do linux in ... javaenvironment-variableswix3jpackage Masonio822 1 asked 6 mins ago 0 votes 0 answers 8 views Programmatic changes to input field on Swing and/or JavaFX, and preventing an infinite loop In JavaFX/Swing, is there a way to distinguish between input field changes caused by a user, and programmatic changes of the input field? I need to have this sequence of events: user-initiated input ... javaswingjavafx Jason S 191k asked 11 mins ago 0 votes 0 answers 6 views Can't deal with dbeaver multiline command In DBeaver (24.2.0) I have no trouble to set a script variable like this : @set var = 'value' I can see either multiline command support by surrounding with @@ like this : @@set var = 'long multiline ... commandmultilinedbeaver Petrus 21 asked 15 mins ago -1 votes 0 answers 6 views In aarch32 mode, will the values ​of x15 - x30 and the high 32 bits of x0 - x14 affect the program? Recently, I've been developing an aarch64 OS kernel and need to support aarch32 user-space programs. I'm studying the Linux implementation, and the following are confusing me: Linux saves/restores ... linux-kernelarmarm64hardware-acceleration untitled 561 asked 15 mins ago 0 votes 0 answers 19 views can't install 'ggiraph' in RStudio on mac I'm trying to install the 'mosaic' package in RStudio (working on a Mac) and have narrowed my failure down to in issue installing the package 'ggiraph'. When I try to install it I get the response ... r Hannah 1 asked 37 mins ago 1 vote 0 answers 8 views Windows Smart Card Minidriver (CPDK v7): certutil enumerates keys but shows \"No cert retrieved\" I am developing a custom read-only Smart Card Minidriver using CPDK v7 (cardmod.h) for a PIV card. The card contains pre-injected RSA keys and X.509 certificates. I can successfully enumerate the ... smartcard Shashikanth Golla 11 asked 38 mins ago 0 votes 0 answers 6 views Can I write Kyverno tests without referencing every resource in results list? I'm getting started with kyverno test and would like to avoid having to declare all resources explicitly in results section (I may and up with many resources), so I tried using checks instead like ... kuberneteskyverno TrogloGeek 111 asked 38 mins ago 0 votes 0 answers 5 views How to measure beam deflection in openmodellica How to find the deflection of a beam in openmodellica? For instance if I have a one meter cantilever beam and a load is acting at the end? In the code below, I have a flexible body and I am trying to ... simulationanalysisopenmodelicabeam Kabir Sharma 21 asked 38 mins ago 0 votes 0 answers 6 views TFS Build Agent as service, is only using 4 CPUs for msbuild I am currently setting up a new build agent. I realized that the builds needs significantly longer than on our old machine, even though the new machine is much more powerful. Then I realized, that ... tfsazure-devops-self-hosted-agent Martini Bianco 1,923 asked 40 mins ago 1 vote 0 answers 13 views Kubernetes cluster gets stuck in service \"etcd\" to be \"up\" Following this tutorial for setting up a kubernetes cluster defined as code with Cluster API using Talos OS and Proxmox with more than one control plane, I´m having an error: service \"etcd\" ... kubernetesproxmoxtaloscluster-api asd123 11 asked 40 mins ago Advice 1 vote 1 replies 18 views Eclipse Release 2025-12 could you help me? I just updated the new version of the Eclipse IDE. I noticed that it is overwriting the Java version to use Java 21, so I need the console inside the IDE to use Java 17. Therefore, ... javaeclipse CCardozo 53 asked 45 mins ago 0 votes 0 answers 14 views Sharing peripheral between two MCUs Is there a way to interface a temperature sensor peripheral with two MCUs via some ICs? How efficient it will be? In this age of AI i tried searching on LLMs but all result seems made up. Please let ... microcontrollersensorsnxp-microcontrollermcu Raulp 8,326 asked 48 mins ago 0 votes 0 answers 11 views Extract key/value from JSON records in Oracle 19c [duplicate] We have the following json values stored in an Oracle 19c table: Line 1: {\"KEY1\":\"VAL1\",\"KEY2\":\"VAL2\",\"KEY3\":\"VAL3\", ... \"KEYn\":&... jsonoracle-database DragosC 1 asked 50 mins ago 0 votes 1 answer 17 views Hiding values of macro variables from libname statements I would like to hide values of certain macro variables (passwords) used in libname statement from logs. Disabling symbolgen, mlogic or mprint is not an option, as debugging without those options is a ... sassas-macro Negdo 532 asked 57 mins ago 15 30 50 per page 1 2 3 4 5 … 1611894 Next",
      "crawl_timestamp": "2026-01-19T22:17:53.009841",
      "isActive": true
    },
    {
      "website": "https://www.stackoverflow.com",
      "section": "footer",
      "content": "Stack Overflow Questions Help Chat Business Stack Internal Stack Data Licensing Stack Ads Company About Press Work Here Legal Privacy Policy Terms of Service Contact Us Cookie Settings Cookie Policy Stack Exchange Network Technology Culture & recreation Life & arts Science Professional Business API Data Blog Facebook Twitter LinkedIn Instagram Site design / logo © 2026 Stack Exchange Inc; user contributions licensed under CC BY-SA . rev 2026.1.14.38635",
      "crawl_timestamp": "2026-01-19T22:17:53.009841",
      "isActive": true
    },
    {
      "website": "https://www.stackoverflow.com",
      "section": "case_study",
      "content": "",
      "crawl_timestamp": "2026-01-19T22:17:53.009841",
      "isActive": true
    }
  ],
  "summary": {
    "total_domains": 9,
    "total_records": 36,
    "records_by_section": {
      "navbar": 9,
      "homepage": 9,
      "footer": 9,
      "case_study": 9
    },
    "domains_processed": [
      "apache.org",
      "docker.com",
      "github.com",
      "linux.org",
      "mozilla.org",
      "nginx.com",
      "processed",
      "python.org",
      "stackoverflow.com"
    ],
    "validation_errors": 0
  }
}